#############################################################
#                                                           #
#       Luis Angel Ortega's (@LinkSake) Brewfile            #
#                                                           #
#############################################################

# Taps
tap 'blacktop/tap'
tap 'jesseduffield/lazygit'

# Brews
brew 'git'            # Version controll
brew 'tmux'           # Term multiplexer
brew 'helix'          # Text editor
brew 'bat'            # Output highlighting (better cat)
brew 'tldr'           # Community-maintained docs (better man)
brew 'tree'           # Directory listings as tree structure
brew 'dua-cli'        # Disk usage analyzer and monitor (better du)
brew 'lazygit'        # Full Git management app
brew 'neofetch'       # Show system data and ditstro info
brew 'tig'            # Text-mode interface for git
brew 'asdf'           # Tool version manager
brew 'btop'           # Resource monitor
brew 'wget'           # Internet file retriever
brew 'pandoc'         # Universal file converter
brew 'ffmpeg'         # Video and audio tool
brew 'folderify'      # Custom foler icons

# Casks
cask 'zed'            # Code editor
cask 'kitty'          # Terminal emulator
cask 'transmission'   # Torrent client
cask 'vlc'            # Media player
cask 'gimp'           # Image editor
cask 'spotify'        # Propietary music streaming
cask '1password'      # Password manager
cask 'brave-browser'  # Web browser
cask 'zen-browser'    # Web browser
cask 'hiddenbar'      # Hide / show annoying menubar icons
cask 'raycast'        # Spotlight alternative
cask 'qlcolorcode'    # QL for code with highlighting
cask 'qlmarkdown'     # QL for markdown files
cask 'qlprettypatch'  # QL for patch / diff files
cask 'qlstephen'      # QL for dev text files
cask 'qlvideo'        # QL for video formats
cask 'quicklook-csv'  # QL for tables in CSV format
cask 'quicklook-json' # QL for JSON, with trees
cask 'webpquicklook'  # QL for WebP image files
